MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0g1/thirdparty/mspm0g1/ti/devices/msp/peripherals/hw_mcan.h
/* MCAN_CCCR Bits */
/* MCAN_CCCR[INIT] Bits */
#define MCAN_CCCR_INIT_OFS                       (0)                             /* !< INIT Offset */
#define MCAN_CCCR_INIT_MASK                      ((uint32_t)0x00000001U)         /* !< Initialization   0  Normal
                                                                                    Operation   1  Initialization is
                                                                                    started Note: Due to the
                                                                                    synchronization mechanism between the
                                                                                    two clock domains, there may be a
                                                                                    delay until the value written to INIT
                                                                                    can be read back. Therefore the
                                                                                    programmer has to assure that the
                                                                                    previous value written to INIT has
                                                                                    been accepted by reading INIT before
                                                                                    setting INIT to a new value. */
/* MCAN_CCCR[CCE] Bits */
#define MCAN_CCCR_CCE_OFS                        (1)                             /* !< CCE Offset */
#define MCAN_CCCR_CCE_MASK                       ((uint32_t)0x00000002U)         /* !< Configuration Change Enable   0
                                                                                    The CPU has no write access to the
                                                                                    protected configuration registers   1
                                                                                    The CPU has write access to the
                                                                                    protected configuration registers
                                                                                    (while CCCR.INIT = '1')   Qualified
                                                                                    Write is possible only with
                                                                                    CCCR.CCE='1' and CCCR.INIT='1'. */
/* MCAN_CCCR[ASM] Bits */
#define MCAN_CCCR_ASM_OFS                        (2)                             /* !< ASM Offset */
#define MCAN_CCCR_ASM_MASK                       ((uint32_t)0x00000004U)         /* !< Restricted Operation Mode. Bit ASM
                                                                                    can only be set by SW when both CCE
                                                                                    and INIT are set to '1'. The bit can
                                                                                    be reset by SW at any time.   0
                                                                                    Normal CAN operation   1  Restricted
                                                                                    Operation Mode active   Qualified
                                                                                    Write 1 to Set is possible only with
                                                                                    CCCR.CCE='1' and CCCR.INIT='1'. */
/* MCAN_CCCR[CSA] Bits */
#define MCAN_CCCR_CSA_OFS                        (3)                             /* !< CSA Offset */
#define MCAN_CCCR_CSA_MASK                       ((uint32_t)0x00000008U)         /* !< Clock Stop Acknowledge   0  No
                                                                                    clock stop acknowledged   1  MCAN may
                                                                                    be set in power down by stopping the
                                                                                    Host and CAN clocks */
/* MCAN_CCCR[CSR] Bits */
#define MCAN_CCCR_CSR_OFS                        (4)                             /* !< CSR Offset */
#define MCAN_CCCR_CSR_MASK                       ((uint32_t)0x00000010U)         /* !< Clock Stop Request   0  No clock
                                                                                    stop is requested   1  Clock stop
                                                                                    requested. When clock stop is
                                                                                    requested, first INIT and then CSA
                                                                                    will be set after all pending
                                                                                    transfer requests have been completed
                                                                                    and the CAN bus reached idle. */
/* MCAN_CCCR[MON] Bits */
#define MCAN_CCCR_MON_OFS                        (5)                             /* !< MON Offset */
#define MCAN_CCCR_MON_MASK                       ((uint32_t)0x00000020U)         /* !< Bus Monitoring Mode. Bit MON can
                                                                                    only be set by SW when both CCE and
                                                                                    INIT are set to '1'. The bit can be
                                                                                    reset by SW at any time.   0  Bus
                                                                                    Monitoring Mode is disabled   1  Bus
                                                                                    Monitoring Mode is enabled
                                                                                    Qualified Write 1 to Set is possible
                                                                                    only with CCCR.CCE='1' and
                                                                                    CCCR.INIT='1'. */
/* MCAN_CCCR[DAR] Bits */
#define MCAN_CCCR_DAR_OFS                        (6)                             /* !< DAR Offset */
#define MCAN_CCCR_DAR_MASK                       ((uint32_t)0x00000040U)         /* !< Disable Automatic Retransmission
                                                                                    0  Automatic retransmission of
                                                                                    messages not transmitted successfully
                                                                                    enabled   1  Automatic retransmission
                                                                                    disabled   Qualified Write is
                                                                                    possible only with CCCR.CCE='1' and
                                                                                    CCCR.INIT='1'. */
/* MCAN_CCCR[TEST] Bits */
#define MCAN_CCCR_TEST_OFS                       (7)                             /* !< TEST Offset */
#define MCAN_CCCR_TEST_MASK                      ((uint32_t)0x00000080U)         /* !< Test Mode Enable   0  Normal
                                                                                    operation, register TEST holds reset
                                                                                    values   1  Test Mode, write access
                                                                                    to register TEST enabled   Qualified
                                                                                    Write 1 to Set is possible only with
                                                                                    CCCR.CCE='1' and CCCR.INIT='1'. */
/* MCAN_CCCR[FDOE] Bits */
#define MCAN_CCCR_FDOE_OFS                       (8)                             /* !< FDOE Offset */
#define MCAN_CCCR_FDOE_MASK                      ((uint32_t)0x00000100U)         /* !< Flexible Datarate Operation Enable
                                                                                    0  FD operation disabled   1  FD
                                                                                    operation enabled   Qualified Write
                                                                                    is possible only with CCCR.CCE='1'
                                                                                    and CCCR.INIT='1'. */
/* MCAN_CCCR[BRSE] Bits */
#define MCAN_CCCR_BRSE_OFS                       (9)                             /* !< BRSE Offset */
#define MCAN_CCCR_BRSE_MASK                      ((uint32_t)0x00000200U)         /* !< Bit Rate Switch Enable   0  Bit
                                                                                    rate switching for transmissions
                                                                                    disabled   1  Bit rate switching for
                                                                                    transmissions enabled Note: When CAN
                                                                                    FD operation is disabled FDOE = '0',
                                                                                    BRSE is not evaluated.   Qualified
                                                                                    Write is possible only with
                                                                                    CCCR.CCE='1' and CCCR.INIT='1'. */
/* MCAN_CCCR[PXHD] Bits */
#define MCAN_CCCR_PXHD_OFS                       (12)                            /* !< PXHD Offset */
#define MCAN_CCCR_PXHD_MASK                      ((uint32_t)0x00001000U)         /* !< Protocol Exception Handling Disable
                                                                                    0  Protocol exception handling
                                                                                    enabled   1  Protocol exception
                                                                                    handling disabled Note: When protocol
                                                                                    exception handling is disabled, the
                                                                                    MCAN will transmit an error frame
                                                                                    when it detects a protocol exception
                                                                                    condition.   Qualified Write is
                                                                                    possible only with CCCR.CCE='1' and
                                                                                    CCCR.INIT='1'. */
/* MCAN_CCCR[EFBI] Bits */
#define MCAN_CCCR_EFBI_OFS                       (13)                            /* !< EFBI Offset */
#define MCAN_CCCR_EFBI_MASK                      ((uint32_t)0x00002000U)         /* !< Edge Filtering during Bus
                                                                                    Integration   0  Edge filtering
                                                                                    disabled   1  Two consecutive
                                                                                    dominant tq required to detect an
                                                                                    edge for hard synchronization
                                                                                    Qualified Write is possible only with
                                                                                    CCCR.CCE='1' and CCCR.INIT='1'. */
/* MCAN_CCCR[TXP] Bits */
#define MCAN_CCCR_TXP_OFS                        (14)                            /* !< TXP Offset */
#define MCAN_CCCR_TXP_MASK                       ((uint32_t)0x00004000U)         /* !< Transmit Pause. If this bit is set,
                                                                                    the MCAN pauses for two CAN bit times
                                                                                    before starting the next transmission
                                                                                    after itself has successfully
                                                                                    transmitted a frame.   0  Transmit
                                                                                    pause disabled   1  Transmit pause
                                                                                    enabled   Qualified Write is possible
                                                                                    only with CCCR.CCE='1' and
                                                                                    CCCR.INIT='1'. */
/* MCAN_CCCR[NISO] Bits */
#define MCAN_CCCR_NISO_OFS                       (15)                            /* !< NISO Offset */
#define MCAN_CCCR_NISO_MASK                      ((uint32_t)0x00008000U)         /* !< Non ISO Operation. If this bit is
                                                                                    set, the MCAN uses the CAN FD frame
                                                                                    format as specified by the Bosch CAN
                                                                                    FD Specification V1.0.   0  CAN FD
                                                                                    frame format according to ISO
                                                                                    11898-1:2015   1  CAN FD frame format
                                                                                    according to Bosch CAN FD
                                                                                    Specification V1.0 */

/* MCAN_NBTP Bits */
/* MCAN_NBTP[NTSEG2] Bits */
#define MCAN_NBTP_NTSEG2_OFS                     (0)                             /* !< NTSEG2 Offset */
#define MCAN_NBTP_NTSEG2_MASK                    ((uint32_t)0x0000007FU)         /* !< Nominal Time Segment After Sample
                                                                                    Point. Valid values are 1 to 127. The
                                                                                    actual interpretation by the hardware
                                                                                    of this value is such that one more
                                                                                    than the programmed value is used.
                                                                                    Qualified Write is possible only with
                                                                                    CCCR.CCE='1' and CCCR.INIT='1'. */
/* MCAN_NBTP[NTSEG1] Bits */
#define MCAN_NBTP_NTSEG1_OFS                     (8)                             /* !< NTSEG1 Offset */
#define MCAN_NBTP_NTSEG1_MASK                    ((uint32_t)0x0000FF00U)         /* !< Nominal Time Segment Before Sample
                                                                                    Point. Valid values are 1 to 255. The
                                                                                    actual interpretation by the hardware
                                                                                    of this value is such that one more
                                                                                    than the programmed value is used.
                                                                                    Qualified Write is possible only with
                                                                                    CCCR.CCE='1' and CCCR.INIT='1'. */
/* MCAN_NBTP[NBRP] Bits */
#define MCAN_NBTP_NBRP_OFS                       (16)                            /* !< NBRP Offset */
#define MCAN_NBTP_NBRP_MASK                      ((uint32_t)0x01FF0000U)         /* !< Nominal Bit Rate Prescaler. The
                                                                                    value by which the oscillator
                                                                                    frequency is divided for generating
                                                                                    the bit time quanta. The bit time is
                                                                                    built up from a multiple of this
                                                                                    quanta. Valid values for the Bit Rate
                                                                                    Prescaler are 0 to 511. The actual
                                                                                    interpretation by the hardware of
                                                                                    this value is such that one more than
                                                                                    the value programmed here is used.
                                                                                    Qualified Write is possible only with
                                                                                    CCCR.CCE='1' and CCCR.INIT='1'. */
/* MCAN_NBTP[NSJW] Bits */
#define MCAN_NBTP_NSJW_OFS                       (25)                            /* !< NSJW Offset */
#define MCAN_NBTP_NSJW_MASK                      ((uint32_t)0xFE000000U)         /* !< Nominal (Re)Synchronization Jump
                                                                                    Width. Valid values are 0 to 127. The
                                                                                    actual interpretation by the hardware
                                                                                    of this value is such that one more
                                                                                    than the value programmed here is
                                                                                    used.   Qualified Write is possible
                                                                                    only with CCCR.CCE='1' and
                                                                                    CCCR.INIT='1'. */

/* MCAN_TSCC Bits */
/* MCAN_TSCC[TSS] Bits */
#define MCAN_TSCC_TSS_OFS                        (0)                             /* !< TSS Offset */
#define MCAN_TSCC_TSS_MASK                       ((uint32_t)0x00000003U)         /* !< Timestamp Select   00  Timestamp
                                                                                    counter value always 0x0000   01
                                                                                    Timestamp counter value incremented
                                                                                    according to TCP   10  External
                                                                                    timestamp counter value used   11
                                                                                    Same as "00"   Qualified Write is
                                                                                    possible only with CCCR.CCE='1' and
                                                                                    CCCR.INIT='1'. */
/* MCAN_TSCC[TCP] Bits */
#define MCAN_TSCC_TCP_OFS                        (16)                            /* !< TCP Offset */
#define MCAN_TSCC_TCP_MASK                       ((uint32_t)0x000F0000U)         /* !< Timestamp Counter Prescaler.
                                                                                    Configures the timestamp and timeout
                                                                                    counters time unit in multiples of
                                                                                    CAN bit times. Valid values are 0 to
                                                                                    15. The actual interpretation by the
                                                                                    hardware of this value is such that
                                                                                    one more than the value programmed
                                                                                    here is used.   Note: With CAN FD an
                                                                                    external counter is required for
                                                                                    timestamp generation (TSS = "10").
                                                                                    Qualified Write is possible only with
                                                                                    CCCR.CCE='1' and CCCR.INIT='1'. */

