MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0g1/thirdparty/mspm0g1/ti/devices/msp/peripherals/hw_mcan.h
                                                                                    finished interrupt disabled   1
                                                                                    Cancellation finished interrupt
                                                                                    enabled */
/* MCAN_TXBCIE[CFIE26] Bits */
#define MCAN_TXBCIE_CFIE26_OFS                   (26)                            /* !< CFIE26 Offset */
#define MCAN_TXBCIE_CFIE26_MASK                  ((uint32_t)0x04000000U)         /* !< Cancellation Finished Interrupt
                                                                                    Enable 26. Each Tx Buffer has its own
                                                                                    Cancellation Finished Interrupt
                                                                                    Enable bit.   0  Cancellation
                                                                                    finished interrupt disabled   1
                                                                                    Cancellation finished interrupt
                                                                                    enabled */
/* MCAN_TXBCIE[CFIE27] Bits */
#define MCAN_TXBCIE_CFIE27_OFS                   (27)                            /* !< CFIE27 Offset */
#define MCAN_TXBCIE_CFIE27_MASK                  ((uint32_t)0x08000000U)         /* !< Cancellation Finished Interrupt
                                                                                    Enable 27. Each Tx Buffer has its own
                                                                                    Cancellation Finished Interrupt
                                                                                    Enable bit.   0  Cancellation
                                                                                    finished interrupt disabled   1
                                                                                    Cancellation finished interrupt
                                                                                    enabled */
/* MCAN_TXBCIE[CFIE28] Bits */
#define MCAN_TXBCIE_CFIE28_OFS                   (28)                            /* !< CFIE28 Offset */
#define MCAN_TXBCIE_CFIE28_MASK                  ((uint32_t)0x10000000U)         /* !< Cancellation Finished Interrupt
                                                                                    Enable 28. Each Tx Buffer has its own
                                                                                    Cancellation Finished Interrupt
                                                                                    Enable bit.   0  Cancellation
                                                                                    finished interrupt disabled   1
                                                                                    Cancellation finished interrupt
                                                                                    enabled */
/* MCAN_TXBCIE[CFIE29] Bits */
#define MCAN_TXBCIE_CFIE29_OFS                   (29)                            /* !< CFIE29 Offset */
#define MCAN_TXBCIE_CFIE29_MASK                  ((uint32_t)0x20000000U)         /* !< Cancellation Finished Interrupt
                                                                                    Enable 29. Each Tx Buffer has its own
                                                                                    Cancellation Finished Interrupt
                                                                                    Enable bit.   0  Cancellation
                                                                                    finished interrupt disabled   1
                                                                                    Cancellation finished interrupt
                                                                                    enabled */
/* MCAN_TXBCIE[CFIE30] Bits */
#define MCAN_TXBCIE_CFIE30_OFS                   (30)                            /* !< CFIE30 Offset */
#define MCAN_TXBCIE_CFIE30_MASK                  ((uint32_t)0x40000000U)         /* !< Cancellation Finished Interrupt
                                                                                    Enable 30. Each Tx Buffer has its own
                                                                                    Cancellation Finished Interrupt
                                                                                    Enable bit.   0  Cancellation
                                                                                    finished interrupt disabled   1
                                                                                    Cancellation finished interrupt
                                                                                    enabled */
/* MCAN_TXBCIE[CFIE31] Bits */
#define MCAN_TXBCIE_CFIE31_OFS                   (31)                            /* !< CFIE31 Offset */
#define MCAN_TXBCIE_CFIE31_MASK                  ((uint32_t)0x80000000U)         /* !< Cancellation Finished Interrupt
                                                                                    Enable 31. Each Tx Buffer has its own
                                                                                    Cancellation Finished Interrupt
                                                                                    Enable bit.   0  Cancellation
                                                                                    finished interrupt disabled   1
                                                                                    Cancellation finished interrupt
                                                                                    enabled */

/* MCAN_TXEFC Bits */
/* MCAN_TXEFC[EFSA] Bits */
#define MCAN_TXEFC_EFSA_OFS                      (2)                             /* !< EFSA Offset */
#define MCAN_TXEFC_EFSA_MASK                     ((uint32_t)0x0000FFFCU)         /* !< Event FIFO Start Address. Start
                                                                                    address of Tx Event FIFO in Message
                                                                                    RAM (32-bit word address). */
/* MCAN_TXEFC[EFS] Bits */
#define MCAN_TXEFC_EFS_OFS                       (16)                            /* !< EFS Offset */
#define MCAN_TXEFC_EFS_MASK                      ((uint32_t)0x003F0000U)         /* !< Event FIFO Size. The Tx Event FIFO
                                                                                    elements are indexed from 0 to EFS -
                                                                                    1.   0      Tx Event FIFO disabled
                                                                                    1-32  Number of Tx Event FIFO
                                                                                    elements   >32   Values greater than
                                                                                    32 are interpreted as 32 */
/* MCAN_TXEFC[EFWM] Bits */
#define MCAN_TXEFC_EFWM_OFS                      (24)                            /* !< EFWM Offset */
#define MCAN_TXEFC_EFWM_MASK                     ((uint32_t)0x3F000000U)         /* !< Event FIFO Watermark   0
                                                                                    Watermark interrupt disabled   1-32
                                                                                    Level for Tx Event FIFO watermark
                                                                                    interrupt (IR.TEFW)   >32   Watermark
                                                                                    interrupt disabled */

/* MCAN_TXEFS Bits */
/* MCAN_TXEFS[EFFL] Bits */
#define MCAN_TXEFS_EFFL_OFS                      (0)                             /* !< EFFL Offset */
#define MCAN_TXEFS_EFFL_MASK                     ((uint32_t)0x0000003FU)         /* !< Event FIFO Fill Level. Number of
                                                                                    elements stored in Tx Event FIFO,
                                                                                    range 0 to 32. */
/* MCAN_TXEFS[EFGI] Bits */
#define MCAN_TXEFS_EFGI_OFS                      (8)                             /* !< EFGI Offset */
#define MCAN_TXEFS_EFGI_MASK                     ((uint32_t)0x00001F00U)         /* !< Event FIFO Get Index. Tx Event FIFO
                                                                                    read index pointer, range 0 to 31. */
/* MCAN_TXEFS[EFPI] Bits */
#define MCAN_TXEFS_EFPI_OFS                      (16)                            /* !< EFPI Offset */
#define MCAN_TXEFS_EFPI_MASK                     ((uint32_t)0x001F0000U)         /* !< Event FIFO Put Index.Tx Event FIFO
                                                                                    write index pointer, range 0 to 31. */
/* MCAN_TXEFS[EFF] Bits */
#define MCAN_TXEFS_EFF_OFS                       (24)                            /* !< EFF Offset */
#define MCAN_TXEFS_EFF_MASK                      ((uint32_t)0x01000000U)         /* !< Event FIFO Full   0  Tx Event FIFO
                                                                                    not full   1  Tx Event FIFO full */
/* MCAN_TXEFS[TEFL] Bits */
#define MCAN_TXEFS_TEFL_OFS                      (25)                            /* !< TEFL Offset */
#define MCAN_TXEFS_TEFL_MASK                     ((uint32_t)0x02000000U)         /* !< Tx Event FIFO Element Lost. This
                                                                                    bit is a copy of interrupt flag
                                                                                    IR.TEFL. When IR.TEFL is reset, this
                                                                                    bit is also reset.   0  No Tx Event
                                                                                    FIFO element lost   1  Tx Event FIFO
                                                                                    element lost, also set after write
                                                                                    attempt to Tx Event FIFO of size
                                                                                    zero. */

